In [1]:
import pandas as pd

In [2]:
# stpes 
#  load the data  --> data colection /data ingestions
dataset = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
# show the data from dataset bydefault =5 row
dataset.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [4]:
#  it returns the last  5 row values
dataset.tail()
dataset.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
#  Basic info
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
# summarize value
dataset.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
# series and Dataframe
# 891  single number called as scaler 
# [2,34,6,8,9] - python -->list 
import numpy as np
d=  np.array([2,34,6,8,9])  # numpy array ---  1D array-->pandas(series)/vector 
# table -->2d  array-->  dataframe(pandas)


#  pandas --> [2,34,6,8,9] --> series --> 1D array

d

array([ 2, 34,  6,  8,  9])

In [8]:
# row and columns called matrix 
#  create 2d array
arr2d = np.array([["a","dsds","c"],[1,2,3]])

arr2d

array([['a', 'dsds', 'c'],
       ['1', '2', '3']], dtype='<U21')

In [9]:
# check dimension 
arr2d.ndim

2

In [10]:
arr2d.shape

(2, 3)

In [11]:
pd.Series(2) #scaler

0    2
dtype: int64

In [12]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
s1 = pd.Series([2,3,4,5,7,8,9])

In [14]:
# indexing 
print(s1[1])

3

In [15]:
s1[6]

np.int64(9)

In [16]:
# indexing -->  [index] when you want to get a single element from the list/array/
# replace the value / reassign 
s1[1] = 10
s1

0     2
1    10
2     4
3     5
4     7
5     8
6     9
dtype: int64

In [17]:
# slicing -->  [start:stop:step] when you want to  get a subset of the list/array/series
# in python range is exclusive of stop value, so if you want to get the last element you have to use len
s1[1:4]

1    10
2     4
3     5
dtype: int64

In [18]:
s1[1:4] = 23
s1

0     2
1    23
2    23
3    23
4     7
5     8
6     9
dtype: int64

In [19]:
s1[1:4] = [23,34,2]
s1

0     2
1    23
2    34
3     2
4     7
5     8
6     9
dtype: int64

In [20]:
s2= pd.Series([4,53,34,23], index=["a","b","c","d"])

In [21]:
s2

a     4
b    53
c    34
d    23
dtype: int64

In [22]:
s2["a"]

np.int64(4)

In [23]:
dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
dataset["Fare"]

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [25]:
s3 = pd.Series(dataset["Fare"],index=dataset["Name"])

In [26]:
s3["Braund, Mr. Owen Harris"]

np.float64(nan)

In [27]:
dataset["Fare"]

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [28]:
type(dataset["Fare"])

pandas.core.series.Series

In [29]:
type(dataset)

pandas.core.frame.DataFrame

In [30]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
# dataFrame
df = pd.DataFrame([[1,2,3,4],[8,7,8,99]])
df

   0  1  2   3
0  1  2  3   4
1  8  7  8  99

In [32]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df.shape

(2, 4)

In [34]:
df

   0  1  2   3
0  1  2  3   4
1  8  7  8  99

In [35]:
print(arr2d)

[['a' 'dsds' 'c']
 ['1' '2' '3']]

In [36]:
arr2d[0,1]

np.str_('dsds')

In [37]:
# pandas indexing using loc and iloc

In [38]:
# dataFrame add custom columns 
df = pd.DataFrame([[1,2,3,4],[8,7,8,99]],columns=["a","b","c","d"])
df

   a  b  c   d
0  1  2  3   4
1  8  7  8  99

In [39]:
# dataFrame add custom columns  and custom index
df = pd.DataFrame([[1,2,3,4],[8,7,8,99]],columns=["a","b","c","d"],index=["x","y"])
df

   a  b  c   d
x  1  2  3   4
y  8  7  8  99

In [40]:
df.rename(columns={"a":3,"b":2,"c":1,"d":0},inplace=True)
df

   3  2  1   0
x  1  2  3   4
y  8  7  8  99

In [41]:
df.reset_index()

  index  3  2  1   0
0     x  1  2  3   4
1     y  8  7  8  99

In [42]:
dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [43]:
# numpy usecase, pandas usecase
# steps in pandas
# 1. import pandas
# data import/datainjextion 

# 1D,2d,
# 1D array/series
# 2D  array/dataframe/ matrix/

# read data
# create series and dataframes, and how to change--> indexing , slicing ,reassing 
# change/set the index  of a dataframe or change/set the columns 

# basic of data 
#  datatypes
# dim
# shape
# size
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, x to y
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   3       2 non-null      int64
 1   2       2 non-null      int64
 2   1       2 non-null      int64
 3   0       2 non-null      int64
dtypes: int64(4)
memory usage: 80.0+ bytes

              3         2         1          0
count  2.000000  2.000000  2.000000   2.000000
mean   4.500000  4.500000  5.500000  51.500000
std    4.949747  3.535534  3.535534  67.175144
min    1.000000  2.000000  3.000000   4.000000
25%    2.750000  3.250000  4.250000  27.750000
50%    4.500000  4.500000  5.500000  51.500000
75%    6.250000  5.750000  6.750000  75.250000
max    8.000000  7.000000  8.000000  99.000000

In [44]:
def func():
    pass

In [45]:
def func1():

SyntaxError: incomplete input (422752300.py, line 2)

In [82]:
country_capitals = {
    "Key":"Value",
  "Germany": "Berlin", 
  "Canada": "Ottawa", 
  "England": "London"
}

# access the value of keys
print(country_capitals["Germany"])    # Output: Berlin
print(country_capitals["England"])    # Output: London

Berlin
London

In [83]:
country_capitals

{'Key': 'Value', 'Germany': 'Berlin', 'Canada': 'Ottawa', 'England': 'London'}

In [85]:
country_capitals.values()

dict_values(['Value', 'Berlin', 'Ottawa', 'London'])

In [86]:
country_capitals.keys()

dict_keys(['Key', 'Germany', 'Canada', 'England'])

In [87]:
country_capitals.items()

dict_items([('Key', 'Value'), ('Germany', 'Berlin'), ('Canada', 'Ottawa'), ('England', 'London')])

In [88]:
country_capitals["india"] = "Delhi"

In [89]:
country_capitals

{'Key': 'Value',
 'Germany': 'Berlin',
 'Canada': 'Ottawa',
 'England': 'London',
 'india': 'Delhi'}

In [90]:
country_capitals.update({"nepal":"kathmandu"})

In [91]:
country_capitals

{'Key': 'Value',
 'Germany': 'Berlin',
 'Canada': 'Ottawa',
 'England': 'London',
 'india': 'Delhi',
 'nepal': 'kathmandu'}

In [93]:
country_capitals.pop("nepal")

'kathmandu'

In [94]:
country_capitals

{'Key': 'Value',
 'Germany': 'Berlin',
 'Canada': 'Ottawa',
 'England': 'London',
 'india': 'Delhi'}

In [96]:
country_capitals.get("india")

'Delhi'

In [98]:
country_capitals["india"]

'Delhi'

In [105]:
# check a number is positive or not
num =int(input("enter the number"))
if num>0:
    print(num,"is a positive number")
else:
    print(num,"is not a positive number")

34 is a positive number

In [106]:
# check a number is positive or not
num =int(input("enter the number"))
if num>0:
    print(num,"is a positive number")
else:
    print(num,"is not a positive number")

45 is a positive number

In [108]:
def check_num():
    # check a number is positive or not
    num =int(input("enter the number"))
    if num>0:
        print(num,"is a positive number")
    else:
        print(num,"is not a positive number")

In [109]:
check_num()

445 is a positive number

In [111]:
check_num()

34 is a positive number

In [127]:
# check odd even
def check_odd_even(num):
    if num % 2 == 0:
        print( "Even")
    else:
        print( "Odd")

In [128]:
check_odd_even(5)

Odd

In [129]:
check_odd_even(num=6)

Even

In [130]:
check_odd_even()

TypeError: check_odd_even() missing 1 required positional argument: 'num'

In [133]:
# check odd even
def check_odd_even(num=10):
    if num % 2 == 0:
        print(num, "Even")
    else:
        print( num,"Odd")

In [134]:
check_odd_even()

10 Even

In [135]:
check_odd_even(62)

62 Even

In [141]:
# function with two arguments
number =10

def add_numbers(num1, num2):
    sum = num1 + num2
    print("Sum: ", sum)
    # print(num1)
    print(number)

print(number)
# function call with two values
add_numbers(5, 4)

10
Sum:  9
10

In [137]:
add_numbers(num2=54,num1=12)

Sum:  66

In [151]:
# 5! 5*4*3*2*1
# 120

product =1
num =5 
for i in range(1,num+1):
    # print(i)
    product = product* i

print(product)

120

In [148]:
# recursion funtion factorial
def factorial(n):
    if n == 0:
        return 1
    else:
        return n * factorial(n-1)

prin

In [149]:
factorial(5)

120

In [ ]:
print()

In [152]:
import numpy

In [ ]:
# numpy
!pip install numpy

In [154]:
# sin30
numpy.sin(.5)

np.float64(0.479425538604203)